; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph2 - mode
	image0 - mode
	spectrograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation3 - direction
	Star4 - direction
	Star2 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Planet7 thermograph2)
	(have_image Phenomenon8 image0)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Star12 thermograph2)
	(have_image Star13 thermograph2)
))

)

; plan
1. (turn_to satellite1 star2 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star2)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 planet11 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet11)
   goals met: 0 of 8
5. (take_image satellite1 planet11 instrument1 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon8 instrument1 image0)
   added: (have_image phenomenon8 image0)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon10 instrument1 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 3 of 8
10. (turn_to satellite0 star2 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star2)
   goals met: 4 of 8
11. (turn_to satellite1 planet7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet7)
   goals met: 4 of 8
12. (take_image satellite1 planet7 instrument1 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 5 of 8
13. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 5 of 8
14. (take_image satellite1 planet9 instrument1 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 6 of 8
15. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 6 of 8
16. (take_image satellite1 star12 instrument1 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 7 of 8
17. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 7 of 8
18. (take_image satellite1 star13 instrument1 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 8 of 8
